{"format": "graph-model", "generatedBy": "2.0.0-dev20190516", "convertedBy": "TensorFlow.js Converter v1.0.1", "modelTopology": {"node": [{"name": "Variable", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Placeholder", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {}}}}, {"name": "Variable_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mul", "op": "Mul", "input": ["Placeholder", "Variable"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "add", "op": "Add", "input": ["Variable_1", "mul"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 36}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "Variable", "shape": [1], "dtype": "float32"}, {"name": "Variable_1", "shape": [1], "dtype": "float32"}]}]}